{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": null, "document_count": 200000, "word_counts": "{\"sudo\": 9518, \"su\": 9518, \"rm\": 9607, \"rf\": 9607, \"exit\": 9615, \"whoami\": 9522, \"scp\": 9545, \"file\": 9545, \"txt\": 9545, \"attacker\": 18929, \"remote\": 18929, \"tmp\": 19113, \"curl\": 9506, \"o\": 9506, \"http\": 18990, \"malicious\": 18990, \"com\": 28374, \"malware\": 9506, \"bin\": 19074, \"ssh\": 18882, \"l\": 9384, \"8080\": 9384, \"target\": 9384, \"80\": 9384, \"cat\": 18913, \"id\": 9498, \"rsa\": 9498, \"ps\": 9451, \"aux\": 9451, \"echo\": 9527, \"'hello'\": 9527, \"pwd\": 9542, \"wget\": 9484, \"payload\": 9484, \"sh\": 9484, \"etc\": 19054, \"passwd\": 9415, \"mkdir\": 9626, \"test\": 9626, \"ls\": 9601, \"mv\": 9568, \"bash\": 19136, \"chmod\": 9639, \"777\": 9639, \"shadow\": 9639, \"netstat\": 9426, \"tulnp\": 9426, \"cd\": 9584, \"root\": 9584, \"uname\": 9501, \"a\": 9501, \"iptables\": 9441, \"f\": 9441}", "word_docs": "{\"sudo\": 9518, \"su\": 9518, \"rf\": 9607, \"rm\": 9607, \"exit\": 9615, \"whoami\": 9522, \"txt\": 9545, \"attacker\": 18929, \"tmp\": 19113, \"scp\": 9545, \"file\": 9545, \"remote\": 18929, \"curl\": 9506, \"malware\": 9506, \"o\": 9506, \"http\": 18990, \"com\": 28374, \"malicious\": 18990, \"bin\": 19074, \"80\": 9384, \"l\": 9384, \"8080\": 9384, \"target\": 9384, \"ssh\": 18882, \"cat\": 18913, \"id\": 9498, \"rsa\": 9498, \"aux\": 9451, \"ps\": 9451, \"'hello'\": 9527, \"echo\": 9527, \"pwd\": 9542, \"sh\": 9484, \"wget\": 9484, \"payload\": 9484, \"passwd\": 9415, \"etc\": 19054, \"test\": 9626, \"mkdir\": 9626, \"ls\": 9601, \"mv\": 9568, \"bash\": 9568, \"chmod\": 9639, \"777\": 9639, \"shadow\": 9639, \"tulnp\": 9426, \"netstat\": 9426, \"cd\": 9584, \"root\": 9584, \"uname\": 9501, \"a\": 9501, \"f\": 9441, \"iptables\": 9441}", "index_docs": "{\"31\": 9518, \"32\": 9518, \"19\": 9607, \"18\": 9607, \"17\": 9615, \"30\": 9522, \"26\": 9545, \"8\": 18929, \"3\": 19113, \"24\": 9545, \"25\": 9545, \"9\": 18929, \"33\": 9506, \"35\": 9506, \"34\": 9506, \"6\": 18990, \"1\": 28374, \"7\": 18990, \"4\": 19074, \"53\": 9384, \"50\": 9384, \"51\": 9384, \"52\": 9384, \"11\": 18882, \"10\": 18913, \"38\": 9498, \"39\": 9498, \"44\": 9451, \"43\": 9451, \"29\": 9527, \"28\": 9527, \"27\": 9542, \"42\": 9484, \"40\": 9484, \"41\": 9484, \"49\": 9415, \"5\": 19054, \"16\": 9626, \"15\": 9626, \"20\": 9601, \"23\": 9568, \"2\": 9568, \"12\": 9639, \"13\": 9639, \"14\": 9639, \"48\": 9426, \"47\": 9426, \"21\": 9584, \"22\": 9584, \"36\": 9501, \"37\": 9501, \"46\": 9441, \"45\": 9441}", "index_word": "{\"1\": \"com\", \"2\": \"bash\", \"3\": \"tmp\", \"4\": \"bin\", \"5\": \"etc\", \"6\": \"http\", \"7\": \"malicious\", \"8\": \"attacker\", \"9\": \"remote\", \"10\": \"cat\", \"11\": \"ssh\", \"12\": \"chmod\", \"13\": \"777\", \"14\": \"shadow\", \"15\": \"mkdir\", \"16\": \"test\", \"17\": \"exit\", \"18\": \"rm\", \"19\": \"rf\", \"20\": \"ls\", \"21\": \"cd\", \"22\": \"root\", \"23\": \"mv\", \"24\": \"scp\", \"25\": \"file\", \"26\": \"txt\", \"27\": \"pwd\", \"28\": \"echo\", \"29\": \"'hello'\", \"30\": \"whoami\", \"31\": \"sudo\", \"32\": \"su\", \"33\": \"curl\", \"34\": \"o\", \"35\": \"malware\", \"36\": \"uname\", \"37\": \"a\", \"38\": \"id\", \"39\": \"rsa\", \"40\": \"wget\", \"41\": \"payload\", \"42\": \"sh\", \"43\": \"ps\", \"44\": \"aux\", \"45\": \"iptables\", \"46\": \"f\", \"47\": \"netstat\", \"48\": \"tulnp\", \"49\": \"passwd\", \"50\": \"l\", \"51\": \"8080\", \"52\": \"target\", \"53\": \"80\"}", "word_index": "{\"com\": 1, \"bash\": 2, \"tmp\": 3, \"bin\": 4, \"etc\": 5, \"http\": 6, \"malicious\": 7, \"attacker\": 8, \"remote\": 9, \"cat\": 10, \"ssh\": 11, \"chmod\": 12, \"777\": 13, \"shadow\": 14, \"mkdir\": 15, \"test\": 16, \"exit\": 17, \"rm\": 18, \"rf\": 19, \"ls\": 20, \"cd\": 21, \"root\": 22, \"mv\": 23, \"scp\": 24, \"file\": 25, \"txt\": 26, \"pwd\": 27, \"echo\": 28, \"'hello'\": 29, \"whoami\": 30, \"sudo\": 31, \"su\": 32, \"curl\": 33, \"o\": 34, \"malware\": 35, \"uname\": 36, \"a\": 37, \"id\": 38, \"rsa\": 39, \"wget\": 40, \"payload\": 41, \"sh\": 42, \"ps\": 43, \"aux\": 44, \"iptables\": 45, \"f\": 46, \"netstat\": 47, \"tulnp\": 48, \"passwd\": 49, \"l\": 50, \"8080\": 51, \"target\": 52, \"80\": 53}"}}