{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<UNK>", "document_count": 100000, "word_counts": "{\"env\": 1317, \"grep\": 4752, \"root\": 13731, \"etc\": 9262, \"passwd\": 3627, \"curl\": 8427, \"https\": 3541, \"fileshare\": 2336, \"com\": 10508, \"payload\": 3602, \"sh\": 8667, \"sudo\": 7381, \"l\": 2601, \"ps\": 3591, \"aux\": 3591, \"sshd\": 740, \"ls\": 4794, \"cat\": 18731, \"welcome\": 1265, \"txt\": 8362, \"echo\": 9799, \"'pwned'\": 1504, \"shadow\": 5635, \"ifconfig\": 1291, \"homework\": 2565, \"rm\": 4903, \"rf\": 4903, \"no\": 1266, \"preserve\": 1266, \"whoami\": 1324, \"mkdir\": 1282, \"test\": 1282, \"'hacked'\": 2878, \"o\": 3615, \"http\": 8475, \"suspicious\": 2383, \"org\": 3621, \"df\": 1256, \"h\": 1256, \"touch\": 1302, \"doc\": 1302, \"find\": 1247, \"name\": 1247, \"'test'\": 1247, \"'hello'\": 1245, \"var\": 8814, \"log\": 6928, \"syslog\": 4348, \"home\": 3280, \"user\": 4022, \"info\": 1220, \"malicious\": 3409, \"malware\": 2574, \"bin\": 4867, \"du\": 1291, \"evil\": 2190, \"exploit\": 2308, \"zip\": 2308, \"'malware'\": 1265, \"tmp\": 6036, \"ssh\": 2587, \"8080\": 1294, \"target\": 1294, \"80\": 1294, \"attacker\": 2570, \"remote\": 2570, \"ping\": 1279, \"google\": 1279, \"bashrc\": 6906, \"'hello\": 1296, \"world'\": 1296, \"which\": 1314, \"python\": 1314, \"iptables\": 1241, \"f\": 1241, \"cd\": 3608, \"wget\": 3589, \"dd\": 1207, \"if\": 1207, \"dev\": 2414, \"zero\": 1207, \"of\": 1207, \"sda\": 1207, \"scp\": 3601, \"file\": 2083, \"192\": 752, \"168\": 752, \"0\": 752, \"2\": 752, \"mv\": 1270, \"bash\": 2540, \"apt\": 4819, \"install\": 3572, \"nmap\": 740, \"su\": 1255, \"chmod\": 3528, \"777\": 3528, \"netstat\": 2597, \"tulnp\": 1298, \"mysql\": 792, \"uname\": 1349, \"a\": 1349, \"watch\": 1299, \"an\": 1299, \"safe\": 1238, \"site\": 2509, \"update\": 4773, \"notes\": 1292, \"data\": 745, \"tar\": 745, \"gz\": 745, \"backup\": 1535, \"server\": 762, \"www\": 2381, \"sql\": 773, \"todo\": 1239, \"history\": 1249, \"htop\": 754, \"known\": 1293, \"hosts\": 1293, \"'password'\": 1236, \"'owned'\": 1611, \"pwd\": 1239, \"al\": 1234, \"auth\": 1290, \"top\": 1291, \"n\": 1291, \"1\": 1291, \"unknown\": 1271, \"script\": 1271, \"readme\": 1282, \"md\": 1282, \"net\": 2078, \"tools\": 2078, \"admin\": 825, \"nginx\": 812}", "word_docs": "{\"env\": 1317, \"passwd\": 3627, \"grep\": 4752, \"root\": 13474, \"etc\": 9262, \"payload\": 3602, \"fileshare\": 2336, \"curl\": 8427, \"com\": 10508, \"sh\": 8667, \"https\": 3541, \"sudo\": 7381, \"l\": 2601, \"ps\": 3591, \"sshd\": 740, \"aux\": 3591, \"ls\": 4794, \"cat\": 18731, \"txt\": 8362, \"welcome\": 1265, \"shadow\": 5635, \"'pwned'\": 1504, \"echo\": 9799, \"ifconfig\": 1291, \"homework\": 2565, \"rm\": 4903, \"no\": 1266, \"preserve\": 1266, \"rf\": 4903, \"whoami\": 1324, \"mkdir\": 1282, \"test\": 1282, \"'hacked'\": 2878, \"org\": 3621, \"suspicious\": 2383, \"o\": 3615, \"http\": 8475, \"h\": 1256, \"df\": 1256, \"touch\": 1302, \"doc\": 1302, \"name\": 1247, \"find\": 1247, \"'test'\": 1247, \"'hello'\": 1245, \"syslog\": 4348, \"log\": 5638, \"var\": 8814, \"home\": 3280, \"info\": 1220, \"user\": 4022, \"malicious\": 3409, \"bin\": 4867, \"malware\": 2574, \"du\": 1291, \"exploit\": 2308, \"evil\": 2190, \"zip\": 2308, \"'malware'\": 1265, \"tmp\": 6036, \"remote\": 2570, \"target\": 1294, \"attacker\": 2570, \"ssh\": 2587, \"8080\": 1294, \"80\": 1294, \"google\": 1279, \"ping\": 1279, \"bashrc\": 6906, \"'hello\": 1296, \"world'\": 1296, \"which\": 1314, \"python\": 1314, \"iptables\": 1241, \"f\": 1241, \"cd\": 3608, \"wget\": 3589, \"dev\": 1207, \"if\": 1207, \"zero\": 1207, \"of\": 1207, \"sda\": 1207, \"dd\": 1207, \"168\": 752, \"0\": 752, \"scp\": 3601, \"file\": 2083, \"192\": 752, \"2\": 752, \"mv\": 1270, \"bash\": 1270, \"install\": 3572, \"nmap\": 740, \"apt\": 4819, \"su\": 1255, \"chmod\": 3528, \"777\": 3528, \"netstat\": 2597, \"tulnp\": 1298, \"mysql\": 792, \"a\": 1349, \"uname\": 1349, \"an\": 1299, \"watch\": 1299, \"safe\": 1238, \"site\": 2509, \"update\": 4773, \"notes\": 1292, \"gz\": 745, \"www\": 2381, \"tar\": 745, \"server\": 762, \"backup\": 1281, \"data\": 745, \"sql\": 773, \"todo\": 1239, \"history\": 1249, \"htop\": 754, \"hosts\": 1293, \"known\": 1293, \"'password'\": 1236, \"'owned'\": 1611, \"pwd\": 1239, \"al\": 1234, \"auth\": 1290, \"top\": 1291, \"1\": 1291, \"n\": 1291, \"script\": 1271, \"unknown\": 1271, \"readme\": 1282, \"md\": 1282, \"net\": 2078, \"tools\": 2078, \"admin\": 825, \"nginx\": 812}", "index_docs": "{\"67\": 1317, \"26\": 3627, \"23\": 4752, \"3\": 13474, \"6\": 9262, \"30\": 3602, \"54\": 2336, \"10\": 8427, \"4\": 10508, \"8\": 8667, \"36\": 3541, \"12\": 7381, \"42\": 2601, \"32\": 3591, \"136\": 740, \"33\": 3591, \"21\": 4794, \"2\": 18731, \"11\": 8362, \"100\": 1265, \"16\": 5635, \"63\": 1504, \"5\": 9799, \"83\": 1291, \"48\": 2565, \"17\": 4903, \"98\": 1266, \"99\": 1266, \"18\": 4903, \"66\": 1324, \"89\": 1282, \"90\": 1282, \"41\": 2878, \"27\": 3621, \"52\": 2383, \"28\": 3615, \"9\": 8475, \"103\": 1256, \"102\": 1256, \"70\": 1302, \"71\": 1302, \"107\": 1247, \"106\": 1247, \"108\": 1247, \"109\": 1245, \"24\": 4348, \"13\": 5638, \"7\": 8814, \"40\": 3280, \"117\": 1220, \"25\": 4022, \"39\": 3409, \"19\": 4867, \"45\": 2574, \"84\": 1291, \"55\": 2308, \"57\": 2190, \"56\": 2308, \"101\": 1265, \"15\": 6036, \"47\": 2570, \"78\": 1294, \"46\": 2570, \"44\": 2587, \"77\": 1294, \"79\": 1294, \"94\": 1279, \"93\": 1279, \"14\": 6906, \"75\": 1296, \"76\": 1296, \"68\": 1314, \"69\": 1314, \"110\": 1241, \"111\": 1241, \"29\": 3608, \"34\": 3589, \"51\": 1207, \"119\": 1207, \"120\": 1207, \"121\": 1207, \"122\": 1207, \"118\": 1207, \"130\": 752, \"131\": 752, \"31\": 3601, \"58\": 2083, \"129\": 752, \"132\": 752, \"97\": 1270, \"49\": 1270, \"35\": 3572, \"137\": 740, \"20\": 4819, \"104\": 1255, \"37\": 3528, \"38\": 3528, \"43\": 2597, \"74\": 1298, \"125\": 792, \"65\": 1349, \"64\": 1349, \"73\": 1299, \"72\": 1299, \"114\": 1238, \"50\": 2509, \"22\": 4773, \"82\": 1292, \"135\": 745, \"53\": 2381, \"134\": 745, \"127\": 762, \"62\": 1281, \"133\": 745, \"126\": 773, \"112\": 1239, \"105\": 1249, \"128\": 754, \"81\": 1293, \"80\": 1293, \"115\": 1236, \"61\": 1611, \"113\": 1239, \"116\": 1234, \"88\": 1290, \"85\": 1291, \"87\": 1291, \"86\": 1291, \"96\": 1271, \"95\": 1271, \"91\": 1282, \"92\": 1282, \"59\": 2078, \"60\": 2078, \"123\": 825, \"124\": 812}", "index_word": "{\"1\": \"<UNK>\", \"2\": \"cat\", \"3\": \"root\", \"4\": \"com\", \"5\": \"echo\", \"6\": \"etc\", \"7\": \"var\", \"8\": \"sh\", \"9\": \"http\", \"10\": \"curl\", \"11\": \"txt\", \"12\": \"sudo\", \"13\": \"log\", \"14\": \"bashrc\", \"15\": \"tmp\", \"16\": \"shadow\", \"17\": \"rm\", \"18\": \"rf\", \"19\": \"bin\", \"20\": \"apt\", \"21\": \"ls\", \"22\": \"update\", \"23\": \"grep\", \"24\": \"syslog\", \"25\": \"user\", \"26\": \"passwd\", \"27\": \"org\", \"28\": \"o\", \"29\": \"cd\", \"30\": \"payload\", \"31\": \"scp\", \"32\": \"ps\", \"33\": \"aux\", \"34\": \"wget\", \"35\": \"install\", \"36\": \"https\", \"37\": \"chmod\", \"38\": \"777\", \"39\": \"malicious\", \"40\": \"home\", \"41\": \"'hacked'\", \"42\": \"l\", \"43\": \"netstat\", \"44\": \"ssh\", \"45\": \"malware\", \"46\": \"attacker\", \"47\": \"remote\", \"48\": \"homework\", \"49\": \"bash\", \"50\": \"site\", \"51\": \"dev\", \"52\": \"suspicious\", \"53\": \"www\", \"54\": \"fileshare\", \"55\": \"exploit\", \"56\": \"zip\", \"57\": \"evil\", \"58\": \"file\", \"59\": \"net\", \"60\": \"tools\", \"61\": \"'owned'\", \"62\": \"backup\", \"63\": \"'pwned'\", \"64\": \"uname\", \"65\": \"a\", \"66\": \"whoami\", \"67\": \"env\", \"68\": \"which\", \"69\": \"python\", \"70\": \"touch\", \"71\": \"doc\", \"72\": \"watch\", \"73\": \"an\", \"74\": \"tulnp\", \"75\": \"'hello\", \"76\": \"world'\", \"77\": \"8080\", \"78\": \"target\", \"79\": \"80\", \"80\": \"known\", \"81\": \"hosts\", \"82\": \"notes\", \"83\": \"ifconfig\", \"84\": \"du\", \"85\": \"top\", \"86\": \"n\", \"87\": \"1\", \"88\": \"auth\", \"89\": \"mkdir\", \"90\": \"test\", \"91\": \"readme\", \"92\": \"md\", \"93\": \"ping\", \"94\": \"google\", \"95\": \"unknown\", \"96\": \"script\", \"97\": \"mv\", \"98\": \"no\", \"99\": \"preserve\", \"100\": \"welcome\", \"101\": \"'malware'\", \"102\": \"df\", \"103\": \"h\", \"104\": \"su\", \"105\": \"history\", \"106\": \"find\", \"107\": \"name\", \"108\": \"'test'\", \"109\": \"'hello'\", \"110\": \"iptables\", \"111\": \"f\", \"112\": \"todo\", \"113\": \"pwd\", \"114\": \"safe\", \"115\": \"'password'\", \"116\": \"al\", \"117\": \"info\", \"118\": \"dd\", \"119\": \"if\", \"120\": \"zero\", \"121\": \"of\", \"122\": \"sda\", \"123\": \"admin\", \"124\": \"nginx\", \"125\": \"mysql\", \"126\": \"sql\", \"127\": \"server\", \"128\": \"htop\", \"129\": \"192\", \"130\": \"168\", \"131\": \"0\", \"132\": \"2\", \"133\": \"data\", \"134\": \"tar\", \"135\": \"gz\", \"136\": \"sshd\", \"137\": \"nmap\"}", "word_index": "{\"<UNK>\": 1, \"cat\": 2, \"root\": 3, \"com\": 4, \"echo\": 5, \"etc\": 6, \"var\": 7, \"sh\": 8, \"http\": 9, \"curl\": 10, \"txt\": 11, \"sudo\": 12, \"log\": 13, \"bashrc\": 14, \"tmp\": 15, \"shadow\": 16, \"rm\": 17, \"rf\": 18, \"bin\": 19, \"apt\": 20, \"ls\": 21, \"update\": 22, \"grep\": 23, \"syslog\": 24, \"user\": 25, \"passwd\": 26, \"org\": 27, \"o\": 28, \"cd\": 29, \"payload\": 30, \"scp\": 31, \"ps\": 32, \"aux\": 33, \"wget\": 34, \"install\": 35, \"https\": 36, \"chmod\": 37, \"777\": 38, \"malicious\": 39, \"home\": 40, \"'hacked'\": 41, \"l\": 42, \"netstat\": 43, \"ssh\": 44, \"malware\": 45, \"attacker\": 46, \"remote\": 47, \"homework\": 48, \"bash\": 49, \"site\": 50, \"dev\": 51, \"suspicious\": 52, \"www\": 53, \"fileshare\": 54, \"exploit\": 55, \"zip\": 56, \"evil\": 57, \"file\": 58, \"net\": 59, \"tools\": 60, \"'owned'\": 61, \"backup\": 62, \"'pwned'\": 63, \"uname\": 64, \"a\": 65, \"whoami\": 66, \"env\": 67, \"which\": 68, \"python\": 69, \"touch\": 70, \"doc\": 71, \"watch\": 72, \"an\": 73, \"tulnp\": 74, \"'hello\": 75, \"world'\": 76, \"8080\": 77, \"target\": 78, \"80\": 79, \"known\": 80, \"hosts\": 81, \"notes\": 82, \"ifconfig\": 83, \"du\": 84, \"top\": 85, \"n\": 86, \"1\": 87, \"auth\": 88, \"mkdir\": 89, \"test\": 90, \"readme\": 91, \"md\": 92, \"ping\": 93, \"google\": 94, \"unknown\": 95, \"script\": 96, \"mv\": 97, \"no\": 98, \"preserve\": 99, \"welcome\": 100, \"'malware'\": 101, \"df\": 102, \"h\": 103, \"su\": 104, \"history\": 105, \"find\": 106, \"name\": 107, \"'test'\": 108, \"'hello'\": 109, \"iptables\": 110, \"f\": 111, \"todo\": 112, \"pwd\": 113, \"safe\": 114, \"'password'\": 115, \"al\": 116, \"info\": 117, \"dd\": 118, \"if\": 119, \"zero\": 120, \"of\": 121, \"sda\": 122, \"admin\": 123, \"nginx\": 124, \"mysql\": 125, \"sql\": 126, \"server\": 127, \"htop\": 128, \"192\": 129, \"168\": 130, \"0\": 131, \"2\": 132, \"data\": 133, \"tar\": 134, \"gz\": 135, \"sshd\": 136, \"nmap\": 137}"}}