{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<UNK>", "document_count": 100000, "word_counts": "{\"rm\": 4798, \"rf\": 4798, \"no\": 1294, \"preserve\": 1294, \"root\": 13690, \"ps\": 3656, \"aux\": 3656, \"grep\": 4837, \"nginx\": 770, \"sudo\": 7447, \"apt\": 4918, \"install\": 3661, \"net\": 2114, \"tools\": 2114, \"ls\": 4915, \"var\": 8550, \"www\": 2289, \"cd\": 3520, \"echo\": 9836, \"'hello'\": 1272, \"scp\": 3480, \"backup\": 1500, \"sql\": 760, \"malicious\": 3314, \"com\": 10526, \"tmp\": 6114, \"curl\": 8536, \"http\": 8432, \"unknown\": 1313, \"site\": 2624, \"script\": 1313, \"sh\": 8744, \"env\": 1234, \"cat\": 18823, \"home\": 3365, \"user\": 4120, \"info\": 1289, \"txt\": 8373, \"homework\": 2570, \"mv\": 1268, \"bin\": 4799, \"bash\": 2536, \"history\": 1248, \"'malware'\": 1291, \"malware\": 2602, \"wget\": 3500, \"suspicious\": 2200, \"org\": 3511, \"exploit\": 2360, \"zip\": 2360, \"file\": 1947, \"server\": 740, \"iptables\": 1241, \"f\": 1241, \"chmod\": 3559, \"777\": 3559, \"log\": 6757, \"syslog\": 4273, \"payload\": 3521, \"attacker\": 2465, \"remote\": 2465, \"bashrc\": 6961, \"'hacked'\": 2895, \"ifconfig\": 1256, \"dd\": 1287, \"if\": 1287, \"dev\": 2574, \"zero\": 1287, \"of\": 1287, \"sda\": 1287, \"df\": 1264, \"h\": 1264, \"'password'\": 1286, \"etc\": 9466, \"passwd\": 3761, \"readme\": 1249, \"md\": 1249, \"data\": 773, \"tar\": 773, \"gz\": 773, \"admin\": 741, \"pwd\": 1251, \"whoami\": 1235, \"shadow\": 5705, \"uname\": 1306, \"a\": 1306, \"https\": 3604, \"safe\": 1311, \"update\": 4788, \"netstat\": 2528, \"tulnp\": 1273, \"todo\": 1317, \"fileshare\": 2307, \"notes\": 1203, \"welcome\": 1310, \"l\": 2487, \"ping\": 1313, \"google\": 1313, \"o\": 3619, \"top\": 1280, \"n\": 1280, \"1\": 1280, \"sshd\": 756, \"mkdir\": 1281, \"test\": 1281, \"su\": 1287, \"'pwned'\": 1547, \"which\": 1330, \"python\": 1330, \"evil\": 2347, \"'hello\": 1276, \"world'\": 1276, \"nmap\": 742, \"'owned'\": 1555, \"find\": 1263, \"name\": 1263, \"'test'\": 1263, \"al\": 1349, \"du\": 1308, \"htop\": 805, \"ssh\": 2536, \"8080\": 1245, \"target\": 1245, \"80\": 1245, \"auth\": 1242, \"known\": 1291, \"hosts\": 1291, \"mysql\": 782, \"192\": 764, \"168\": 764, \"0\": 764, \"2\": 764, \"touch\": 1263, \"doc\": 1263, \"watch\": 1255, \"an\": 1255}", "word_docs": "{\"preserve\": 1294, \"root\": 13453, \"no\": 1294, \"rf\": 4798, \"rm\": 4798, \"grep\": 4837, \"nginx\": 770, \"aux\": 3656, \"ps\": 3656, \"sudo\": 7447, \"install\": 3661, \"tools\": 2114, \"net\": 2114, \"apt\": 4918, \"ls\": 4915, \"www\": 2289, \"var\": 8550, \"cd\": 3520, \"'hello'\": 1272, \"echo\": 9836, \"com\": 10526, \"backup\": 1249, \"scp\": 3480, \"sql\": 760, \"malicious\": 3314, \"tmp\": 6114, \"unknown\": 1313, \"script\": 1313, \"site\": 2624, \"http\": 8432, \"sh\": 8744, \"curl\": 8536, \"env\": 1234, \"txt\": 8373, \"user\": 4120, \"home\": 3365, \"cat\": 18823, \"info\": 1289, \"homework\": 2570, \"bash\": 1268, \"mv\": 1268, \"bin\": 4799, \"history\": 1248, \"'malware'\": 1291, \"malware\": 2602, \"suspicious\": 2200, \"zip\": 2360, \"exploit\": 2360, \"wget\": 3500, \"org\": 3511, \"server\": 740, \"file\": 1947, \"iptables\": 1241, \"f\": 1241, \"syslog\": 4273, \"chmod\": 3559, \"log\": 5515, \"777\": 3559, \"payload\": 3521, \"remote\": 2465, \"attacker\": 2465, \"bashrc\": 6961, \"'hacked'\": 2895, \"ifconfig\": 1256, \"sda\": 1287, \"zero\": 1287, \"dd\": 1287, \"of\": 1287, \"dev\": 1287, \"if\": 1287, \"df\": 1264, \"h\": 1264, \"passwd\": 3761, \"etc\": 9466, \"'password'\": 1286, \"md\": 1249, \"readme\": 1249, \"admin\": 741, \"data\": 773, \"gz\": 773, \"tar\": 773, \"pwd\": 1251, \"whoami\": 1235, \"shadow\": 5705, \"uname\": 1306, \"a\": 1306, \"update\": 4788, \"safe\": 1311, \"https\": 3604, \"netstat\": 2528, \"tulnp\": 1273, \"todo\": 1317, \"fileshare\": 2307, \"notes\": 1203, \"welcome\": 1310, \"l\": 2487, \"ping\": 1313, \"google\": 1313, \"o\": 3619, \"1\": 1280, \"n\": 1280, \"top\": 1280, \"sshd\": 756, \"test\": 1281, \"mkdir\": 1281, \"su\": 1287, \"'pwned'\": 1547, \"which\": 1330, \"python\": 1330, \"evil\": 2347, \"world'\": 1276, \"'hello\": 1276, \"nmap\": 742, \"'owned'\": 1555, \"'test'\": 1263, \"find\": 1263, \"name\": 1263, \"al\": 1349, \"du\": 1308, \"htop\": 805, \"target\": 1245, \"8080\": 1245, \"ssh\": 2536, \"80\": 1245, \"auth\": 1242, \"hosts\": 1291, \"known\": 1291, \"mysql\": 782, \"168\": 764, \"2\": 764, \"0\": 764, \"192\": 764, \"doc\": 1263, \"touch\": 1263, \"watch\": 1255, \"an\": 1255}", "index_docs": "{\"78\": 1294, \"3\": 13453, \"77\": 1294, \"22\": 4798, \"21\": 4798, \"19\": 4837, \"128\": 770, \"29\": 3656, \"28\": 3656, \"12\": 7447, \"27\": 3661, \"59\": 2114, \"58\": 2114, \"17\": 4918, \"18\": 4915, \"56\": 2289, \"8\": 8550, \"35\": 3520, \"98\": 1272, \"5\": 9836, \"4\": 10526, \"63\": 1249, \"38\": 3480, \"133\": 760, \"40\": 3314, \"15\": 6114, \"68\": 1313, \"69\": 1313, \"42\": 2624, \"10\": 8432, \"7\": 8744, \"9\": 8536, \"121\": 1234, \"11\": 8373, \"25\": 4120, \"39\": 3365, \"2\": 18823, \"82\": 1289, \"45\": 2570, \"46\": 1268, \"99\": 1268, \"20\": 4799, \"113\": 1248, \"79\": 1291, \"43\": 2602, \"57\": 2200, \"53\": 2360, \"52\": 2360, \"37\": 3500, \"36\": 3511, \"137\": 740, \"60\": 1947, \"118\": 1241, \"119\": 1241, \"24\": 4273, \"32\": 3559, \"14\": 5515, \"33\": 3559, \"34\": 3521, \"51\": 2465, \"50\": 2465, \"13\": 6961, \"41\": 2895, \"107\": 1256, \"87\": 1287, \"85\": 1287, \"83\": 1287, \"86\": 1287, \"44\": 1287, \"84\": 1287, \"100\": 1264, \"101\": 1264, \"26\": 3761, \"6\": 9466, \"89\": 1286, \"112\": 1249, \"111\": 1249, \"136\": 741, \"125\": 773, \"127\": 773, \"126\": 773, \"110\": 1251, \"120\": 1235, \"16\": 5705, \"75\": 1306, \"76\": 1306, \"23\": 4788, \"72\": 1311, \"31\": 3604, \"48\": 2528, \"97\": 1273, \"67\": 1317, \"55\": 2307, \"122\": 1203, \"73\": 1310, \"49\": 2487, \"70\": 1313, \"71\": 1313, \"30\": 3619, \"94\": 1280, \"93\": 1280, \"92\": 1280, \"134\": 756, \"91\": 1281, \"90\": 1281, \"88\": 1287, \"62\": 1547, \"65\": 1330, \"66\": 1330, \"54\": 2347, \"96\": 1276, \"95\": 1276, \"135\": 742, \"61\": 1555, \"104\": 1263, \"102\": 1263, \"103\": 1263, \"64\": 1349, \"74\": 1308, \"123\": 805, \"115\": 1245, \"114\": 1245, \"47\": 2536, \"116\": 1245, \"117\": 1242, \"81\": 1291, \"80\": 1291, \"124\": 782, \"130\": 764, \"132\": 764, \"131\": 764, \"129\": 764, \"106\": 1263, \"105\": 1263, \"108\": 1255, \"109\": 1255}", "index_word": "{\"1\": \"<UNK>\", \"2\": \"cat\", \"3\": \"root\", \"4\": \"com\", \"5\": \"echo\", \"6\": \"etc\", \"7\": \"sh\", \"8\": \"var\", \"9\": \"curl\", \"10\": \"http\", \"11\": \"txt\", \"12\": \"sudo\", \"13\": \"bashrc\", \"14\": \"log\", \"15\": \"tmp\", \"16\": \"shadow\", \"17\": \"apt\", \"18\": \"ls\", \"19\": \"grep\", \"20\": \"bin\", \"21\": \"rm\", \"22\": \"rf\", \"23\": \"update\", \"24\": \"syslog\", \"25\": \"user\", \"26\": \"passwd\", \"27\": \"install\", \"28\": \"ps\", \"29\": \"aux\", \"30\": \"o\", \"31\": \"https\", \"32\": \"chmod\", \"33\": \"777\", \"34\": \"payload\", \"35\": \"cd\", \"36\": \"org\", \"37\": \"wget\", \"38\": \"scp\", \"39\": \"home\", \"40\": \"malicious\", \"41\": \"'hacked'\", \"42\": \"site\", \"43\": \"malware\", \"44\": \"dev\", \"45\": \"homework\", \"46\": \"bash\", \"47\": \"ssh\", \"48\": \"netstat\", \"49\": \"l\", \"50\": \"attacker\", \"51\": \"remote\", \"52\": \"exploit\", \"53\": \"zip\", \"54\": \"evil\", \"55\": \"fileshare\", \"56\": \"www\", \"57\": \"suspicious\", \"58\": \"net\", \"59\": \"tools\", \"60\": \"file\", \"61\": \"'owned'\", \"62\": \"'pwned'\", \"63\": \"backup\", \"64\": \"al\", \"65\": \"which\", \"66\": \"python\", \"67\": \"todo\", \"68\": \"unknown\", \"69\": \"script\", \"70\": \"ping\", \"71\": \"google\", \"72\": \"safe\", \"73\": \"welcome\", \"74\": \"du\", \"75\": \"uname\", \"76\": \"a\", \"77\": \"no\", \"78\": \"preserve\", \"79\": \"'malware'\", \"80\": \"known\", \"81\": \"hosts\", \"82\": \"info\", \"83\": \"dd\", \"84\": \"if\", \"85\": \"zero\", \"86\": \"of\", \"87\": \"sda\", \"88\": \"su\", \"89\": \"'password'\", \"90\": \"mkdir\", \"91\": \"test\", \"92\": \"top\", \"93\": \"n\", \"94\": \"1\", \"95\": \"'hello\", \"96\": \"world'\", \"97\": \"tulnp\", \"98\": \"'hello'\", \"99\": \"mv\", \"100\": \"df\", \"101\": \"h\", \"102\": \"find\", \"103\": \"name\", \"104\": \"'test'\", \"105\": \"touch\", \"106\": \"doc\", \"107\": \"ifconfig\", \"108\": \"watch\", \"109\": \"an\", \"110\": \"pwd\", \"111\": \"readme\", \"112\": \"md\", \"113\": \"history\", \"114\": \"8080\", \"115\": \"target\", \"116\": \"80\", \"117\": \"auth\", \"118\": \"iptables\", \"119\": \"f\", \"120\": \"whoami\", \"121\": \"env\", \"122\": \"notes\", \"123\": \"htop\", \"124\": \"mysql\", \"125\": \"data\", \"126\": \"tar\", \"127\": \"gz\", \"128\": \"nginx\", \"129\": \"192\", \"130\": \"168\", \"131\": \"0\", \"132\": \"2\", \"133\": \"sql\", \"134\": \"sshd\", \"135\": \"nmap\", \"136\": \"admin\", \"137\": \"server\"}", "word_index": "{\"<UNK>\": 1, \"cat\": 2, \"root\": 3, \"com\": 4, \"echo\": 5, \"etc\": 6, \"sh\": 7, \"var\": 8, \"curl\": 9, \"http\": 10, \"txt\": 11, \"sudo\": 12, \"bashrc\": 13, \"log\": 14, \"tmp\": 15, \"shadow\": 16, \"apt\": 17, \"ls\": 18, \"grep\": 19, \"bin\": 20, \"rm\": 21, \"rf\": 22, \"update\": 23, \"syslog\": 24, \"user\": 25, \"passwd\": 26, \"install\": 27, \"ps\": 28, \"aux\": 29, \"o\": 30, \"https\": 31, \"chmod\": 32, \"777\": 33, \"payload\": 34, \"cd\": 35, \"org\": 36, \"wget\": 37, \"scp\": 38, \"home\": 39, \"malicious\": 40, \"'hacked'\": 41, \"site\": 42, \"malware\": 43, \"dev\": 44, \"homework\": 45, \"bash\": 46, \"ssh\": 47, \"netstat\": 48, \"l\": 49, \"attacker\": 50, \"remote\": 51, \"exploit\": 52, \"zip\": 53, \"evil\": 54, \"fileshare\": 55, \"www\": 56, \"suspicious\": 57, \"net\": 58, \"tools\": 59, \"file\": 60, \"'owned'\": 61, \"'pwned'\": 62, \"backup\": 63, \"al\": 64, \"which\": 65, \"python\": 66, \"todo\": 67, \"unknown\": 68, \"script\": 69, \"ping\": 70, \"google\": 71, \"safe\": 72, \"welcome\": 73, \"du\": 74, \"uname\": 75, \"a\": 76, \"no\": 77, \"preserve\": 78, \"'malware'\": 79, \"known\": 80, \"hosts\": 81, \"info\": 82, \"dd\": 83, \"if\": 84, \"zero\": 85, \"of\": 86, \"sda\": 87, \"su\": 88, \"'password'\": 89, \"mkdir\": 90, \"test\": 91, \"top\": 92, \"n\": 93, \"1\": 94, \"'hello\": 95, \"world'\": 96, \"tulnp\": 97, \"'hello'\": 98, \"mv\": 99, \"df\": 100, \"h\": 101, \"find\": 102, \"name\": 103, \"'test'\": 104, \"touch\": 105, \"doc\": 106, \"ifconfig\": 107, \"watch\": 108, \"an\": 109, \"pwd\": 110, \"readme\": 111, \"md\": 112, \"history\": 113, \"8080\": 114, \"target\": 115, \"80\": 116, \"auth\": 117, \"iptables\": 118, \"f\": 119, \"whoami\": 120, \"env\": 121, \"notes\": 122, \"htop\": 123, \"mysql\": 124, \"data\": 125, \"tar\": 126, \"gz\": 127, \"nginx\": 128, \"192\": 129, \"168\": 130, \"0\": 131, \"2\": 132, \"sql\": 133, \"sshd\": 134, \"nmap\": 135, \"admin\": 136, \"server\": 137}"}}