{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<UNK>", "document_count": 100000, "word_counts": "{\"chmod\": 3762, \"777\": 3762, \"root\": 10896, \"bashrc\": 6141, \"curl\": 7688, \"o\": 3846, \"http\": 7685, \"suspicious\": 2302, \"org\": 3839, \"update\": 5329, \"bin\": 5387, \"mkdir\": 1565, \"test\": 1565, \"cat\": 17902, \"home\": 4006, \"user\": 4787, \"info\": 1606, \"txt\": 10204, \"rm\": 5557, \"rf\": 5557, \"var\": 7676, \"scp\": 3812, \"file\": 2240, \"backup\": 1504, \"server\": 745, \"tmp\": 6905, \"uname\": 1583, \"a\": 1583, \"ssh\": 1574, \"l\": 3163, \"8080\": 1574, \"target\": 1574, \"com\": 11586, \"80\": 1574, \"attacker\": 3084, \"remote\": 3084, \"top\": 1550, \"n\": 1550, \"1\": 1550, \"echo\": 11006, \"'pwned'\": 1568, \"etc\": 9313, \"shadow\": 6143, \"ps\": 3862, \"aux\": 3862, \"grep\": 3931, \"sshd\": 812, \"https\": 3842, \"safe\": 1537, \"site\": 1537, \"sh\": 8477, \"welcome\": 1561, \"passwd\": 3170, \"'owned'\": 1649, \"cd\": 3812, \"ls\": 3857, \"whoami\": 1632, \"sudo\": 8465, \"apt\": 5346, \"install\": 3847, \"net\": 2312, \"tools\": 2312, \"www\": 2295, \"pwd\": 1515, \"wget\": 3839, \"malicious\": 3874, \"payload\": 3813, \"dd\": 1473, \"if\": 1473, \"dev\": 2946, \"zero\": 1473, \"of\": 1473, \"sda\": 1473, \"'password'\": 1569, \"'hello\": 1493, \"world'\": 1493, \"ping\": 1545, \"google\": 1545, \"du\": 1556, \"log\": 6107, \"auth\": 1527, \"exploit\": 2349, \"zip\": 2349, \"data\": 813, \"tar\": 813, \"gz\": 813, \"malware\": 3106, \"find\": 1591, \"name\": 1591, \"'test'\": 1591, \"'malware'\": 1571, \"mv\": 1559, \"bash\": 3118, \"notes\": 1604, \"netstat\": 1536, \"tulnp\": 1536, \"df\": 1586, \"h\": 1586, \"evil\": 2291, \"readme\": 1538, \"md\": 1538, \"'hacked'\": 3086, \"no\": 1623, \"preserve\": 1623, \"nginx\": 817, \"todo\": 1616, \"su\": 1530, \"homework\": 3082, \"htop\": 757, \"admin\": 787, \"iptables\": 1514, \"f\": 1514, \"touch\": 1505, \"doc\": 1505, \"sql\": 759, \"mysql\": 733, \"syslog\": 3053, \"nmap\": 778, \"192\": 778, \"168\": 778, \"0\": 778, \"2\": 778, \"al\": 1520, \"'hello'\": 1639, \"ifconfig\": 1585, \"fileshare\": 2302}", "word_docs": "{\"777\": 3762, \"bashrc\": 6141, \"root\": 10660, \"chmod\": 3762, \"suspicious\": 2302, \"http\": 7685, \"update\": 5329, \"curl\": 7688, \"bin\": 5387, \"o\": 3846, \"org\": 3839, \"mkdir\": 1565, \"test\": 1565, \"home\": 4006, \"info\": 1606, \"txt\": 10204, \"cat\": 17902, \"user\": 4787, \"rf\": 5557, \"var\": 7676, \"rm\": 5557, \"tmp\": 6905, \"server\": 745, \"backup\": 1259, \"scp\": 3812, \"file\": 2240, \"uname\": 1583, \"a\": 1583, \"80\": 1574, \"ssh\": 1574, \"8080\": 1574, \"target\": 1574, \"com\": 11586, \"remote\": 3084, \"l\": 3163, \"attacker\": 3084, \"top\": 1550, \"1\": 1550, \"n\": 1550, \"shadow\": 6143, \"etc\": 9313, \"'pwned'\": 1568, \"echo\": 11006, \"ps\": 3862, \"grep\": 3931, \"sshd\": 812, \"aux\": 3862, \"sh\": 8477, \"site\": 1537, \"safe\": 1537, \"https\": 3842, \"welcome\": 1561, \"passwd\": 3170, \"'owned'\": 1649, \"cd\": 3812, \"ls\": 3857, \"whoami\": 1632, \"tools\": 2312, \"sudo\": 8465, \"apt\": 5346, \"install\": 3847, \"net\": 2312, \"www\": 2295, \"pwd\": 1515, \"wget\": 3839, \"payload\": 3813, \"malicious\": 3874, \"sda\": 1473, \"dd\": 1473, \"if\": 1473, \"zero\": 1473, \"dev\": 1473, \"of\": 1473, \"'password'\": 1569, \"world'\": 1493, \"'hello\": 1493, \"google\": 1545, \"ping\": 1545, \"du\": 1556, \"auth\": 1527, \"log\": 4580, \"exploit\": 2349, \"zip\": 2349, \"data\": 813, \"gz\": 813, \"tar\": 813, \"malware\": 3106, \"find\": 1591, \"name\": 1591, \"'test'\": 1591, \"'malware'\": 1571, \"mv\": 1559, \"bash\": 1559, \"notes\": 1604, \"netstat\": 1536, \"tulnp\": 1536, \"df\": 1586, \"h\": 1586, \"evil\": 2291, \"md\": 1538, \"readme\": 1538, \"'hacked'\": 3086, \"no\": 1623, \"preserve\": 1623, \"nginx\": 817, \"todo\": 1616, \"su\": 1530, \"homework\": 3082, \"htop\": 757, \"admin\": 787, \"iptables\": 1514, \"f\": 1514, \"touch\": 1505, \"doc\": 1505, \"sql\": 759, \"mysql\": 733, \"syslog\": 3053, \"nmap\": 778, \"0\": 778, \"192\": 778, \"2\": 778, \"168\": 778, \"al\": 1520, \"'hello'\": 1639, \"ifconfig\": 1585, \"fileshare\": 2302}", "index_docs": "{\"38\": 3762, \"15\": 6141, \"5\": 10660, \"37\": 3762, \"53\": 2302, \"11\": 7685, \"21\": 5329, \"10\": 7688, \"19\": 5387, \"30\": 3846, \"32\": 3839, \"81\": 1565, \"82\": 1565, \"23\": 4006, \"64\": 1606, \"6\": 10204, \"2\": 17902, \"22\": 4787, \"18\": 5557, \"12\": 7676, \"17\": 5557, \"13\": 6905, \"126\": 745, \"105\": 1259, \"35\": 3812, \"57\": 2240, \"72\": 1583, \"73\": 1583, \"77\": 1574, \"74\": 1574, \"75\": 1574, \"76\": 1574, \"3\": 11586, \"45\": 3084, \"40\": 3163, \"44\": 3084, \"86\": 1550, \"88\": 1550, \"87\": 1550, \"14\": 6143, \"7\": 9313, \"80\": 1568, \"4\": 11006, \"26\": 3862, \"24\": 3931, \"117\": 812, \"27\": 3862, \"8\": 8477, \"94\": 1537, \"93\": 1537, \"31\": 3842, \"83\": 1561, \"39\": 3170, \"58\": 1649, \"36\": 3812, \"28\": 3857, \"60\": 1632, \"52\": 2312, \"9\": 8465, \"20\": 5346, \"29\": 3847, \"51\": 2312, \"55\": 2295, \"100\": 1515, \"33\": 3839, \"34\": 3813, \"25\": 3874, \"112\": 1473, \"108\": 1473, \"109\": 1473, \"110\": 1473, \"48\": 1473, \"111\": 1473, \"79\": 1569, \"107\": 1493, \"106\": 1493, \"90\": 1545, \"89\": 1545, \"85\": 1556, \"98\": 1527, \"16\": 4580, \"49\": 2349, \"50\": 2349, \"114\": 813, \"116\": 813, \"115\": 813, \"42\": 3106, \"66\": 1591, \"67\": 1591, \"68\": 1591, \"78\": 1571, \"84\": 1559, \"41\": 1559, \"65\": 1604, \"95\": 1536, \"96\": 1536, \"69\": 1586, \"70\": 1586, \"56\": 2291, \"92\": 1538, \"91\": 1538, \"43\": 3086, \"61\": 1623, \"62\": 1623, \"113\": 817, \"63\": 1616, \"97\": 1530, \"46\": 3082, \"125\": 757, \"118\": 787, \"101\": 1514, \"102\": 1514, \"103\": 1505, \"104\": 1505, \"124\": 759, \"127\": 733, \"47\": 3053, \"119\": 778, \"122\": 778, \"120\": 778, \"123\": 778, \"121\": 778, \"99\": 1520, \"59\": 1639, \"71\": 1585, \"54\": 2302}", "index_word": "{\"1\": \"<UNK>\", \"2\": \"cat\", \"3\": \"com\", \"4\": \"echo\", \"5\": \"root\", \"6\": \"txt\", \"7\": \"etc\", \"8\": \"sh\", \"9\": \"sudo\", \"10\": \"curl\", \"11\": \"http\", \"12\": \"var\", \"13\": \"tmp\", \"14\": \"shadow\", \"15\": \"bashrc\", \"16\": \"log\", \"17\": \"rm\", \"18\": \"rf\", \"19\": \"bin\", \"20\": \"apt\", \"21\": \"update\", \"22\": \"user\", \"23\": \"home\", \"24\": \"grep\", \"25\": \"malicious\", \"26\": \"ps\", \"27\": \"aux\", \"28\": \"ls\", \"29\": \"install\", \"30\": \"o\", \"31\": \"https\", \"32\": \"org\", \"33\": \"wget\", \"34\": \"payload\", \"35\": \"scp\", \"36\": \"cd\", \"37\": \"chmod\", \"38\": \"777\", \"39\": \"passwd\", \"40\": \"l\", \"41\": \"bash\", \"42\": \"malware\", \"43\": \"'hacked'\", \"44\": \"attacker\", \"45\": \"remote\", \"46\": \"homework\", \"47\": \"syslog\", \"48\": \"dev\", \"49\": \"exploit\", \"50\": \"zip\", \"51\": \"net\", \"52\": \"tools\", \"53\": \"suspicious\", \"54\": \"fileshare\", \"55\": \"www\", \"56\": \"evil\", \"57\": \"file\", \"58\": \"'owned'\", \"59\": \"'hello'\", \"60\": \"whoami\", \"61\": \"no\", \"62\": \"preserve\", \"63\": \"todo\", \"64\": \"info\", \"65\": \"notes\", \"66\": \"find\", \"67\": \"name\", \"68\": \"'test'\", \"69\": \"df\", \"70\": \"h\", \"71\": \"ifconfig\", \"72\": \"uname\", \"73\": \"a\", \"74\": \"ssh\", \"75\": \"8080\", \"76\": \"target\", \"77\": \"80\", \"78\": \"'malware'\", \"79\": \"'password'\", \"80\": \"'pwned'\", \"81\": \"mkdir\", \"82\": \"test\", \"83\": \"welcome\", \"84\": \"mv\", \"85\": \"du\", \"86\": \"top\", \"87\": \"n\", \"88\": \"1\", \"89\": \"ping\", \"90\": \"google\", \"91\": \"readme\", \"92\": \"md\", \"93\": \"safe\", \"94\": \"site\", \"95\": \"netstat\", \"96\": \"tulnp\", \"97\": \"su\", \"98\": \"auth\", \"99\": \"al\", \"100\": \"pwd\", \"101\": \"iptables\", \"102\": \"f\", \"103\": \"touch\", \"104\": \"doc\", \"105\": \"backup\", \"106\": \"'hello\", \"107\": \"world'\", \"108\": \"dd\", \"109\": \"if\", \"110\": \"zero\", \"111\": \"of\", \"112\": \"sda\", \"113\": \"nginx\", \"114\": \"data\", \"115\": \"tar\", \"116\": \"gz\", \"117\": \"sshd\", \"118\": \"admin\", \"119\": \"nmap\", \"120\": \"192\", \"121\": \"168\", \"122\": \"0\", \"123\": \"2\", \"124\": \"sql\", \"125\": \"htop\", \"126\": \"server\", \"127\": \"mysql\"}", "word_index": "{\"<UNK>\": 1, \"cat\": 2, \"com\": 3, \"echo\": 4, \"root\": 5, \"txt\": 6, \"etc\": 7, \"sh\": 8, \"sudo\": 9, \"curl\": 10, \"http\": 11, \"var\": 12, \"tmp\": 13, \"shadow\": 14, \"bashrc\": 15, \"log\": 16, \"rm\": 17, \"rf\": 18, \"bin\": 19, \"apt\": 20, \"update\": 21, \"user\": 22, \"home\": 23, \"grep\": 24, \"malicious\": 25, \"ps\": 26, \"aux\": 27, \"ls\": 28, \"install\": 29, \"o\": 30, \"https\": 31, \"org\": 32, \"wget\": 33, \"payload\": 34, \"scp\": 35, \"cd\": 36, \"chmod\": 37, \"777\": 38, \"passwd\": 39, \"l\": 40, \"bash\": 41, \"malware\": 42, \"'hacked'\": 43, \"attacker\": 44, \"remote\": 45, \"homework\": 46, \"syslog\": 47, \"dev\": 48, \"exploit\": 49, \"zip\": 50, \"net\": 51, \"tools\": 52, \"suspicious\": 53, \"fileshare\": 54, \"www\": 55, \"evil\": 56, \"file\": 57, \"'owned'\": 58, \"'hello'\": 59, \"whoami\": 60, \"no\": 61, \"preserve\": 62, \"todo\": 63, \"info\": 64, \"notes\": 65, \"find\": 66, \"name\": 67, \"'test'\": 68, \"df\": 69, \"h\": 70, \"ifconfig\": 71, \"uname\": 72, \"a\": 73, \"ssh\": 74, \"8080\": 75, \"target\": 76, \"80\": 77, \"'malware'\": 78, \"'password'\": 79, \"'pwned'\": 80, \"mkdir\": 81, \"test\": 82, \"welcome\": 83, \"mv\": 84, \"du\": 85, \"top\": 86, \"n\": 87, \"1\": 88, \"ping\": 89, \"google\": 90, \"readme\": 91, \"md\": 92, \"safe\": 93, \"site\": 94, \"netstat\": 95, \"tulnp\": 96, \"su\": 97, \"auth\": 98, \"al\": 99, \"pwd\": 100, \"iptables\": 101, \"f\": 102, \"touch\": 103, \"doc\": 104, \"backup\": 105, \"'hello\": 106, \"world'\": 107, \"dd\": 108, \"if\": 109, \"zero\": 110, \"of\": 111, \"sda\": 112, \"nginx\": 113, \"data\": 114, \"tar\": 115, \"gz\": 116, \"sshd\": 117, \"admin\": 118, \"nmap\": 119, \"192\": 120, \"168\": 121, \"0\": 122, \"2\": 123, \"sql\": 124, \"htop\": 125, \"server\": 126, \"mysql\": 127}"}}