{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<UNK>", "document_count": 500000, "word_counts": "{\"find\": 14211, \"name\": 14211, \"'test'\": 14211, \"uname\": 14364, \"a\": 14364, \"du\": 14245, \"sh\": 42673, \"mv\": 14351, \"bin\": 28534, \"bash\": 28702, \"tmp\": 42725, \"ping\": 14383, \"google\": 14383, \"com\": 57052, \"ssh\": 14163, \"l\": 28412, \"8080\": 14163, \"target\": 14163, \"80\": 14163, \"attacker\": 28432, \"remote\": 28432, \"sudo\": 28624, \"wget\": 14323, \"http\": 28506, \"malicious\": 28506, \"payload\": 14323, \"echo\": 42512, \"'malware'\": 14105, \"malware\": 28288, \"iptables\": 28580, \"f\": 14464, \"netstat\": 14276, \"tulnp\": 14276, \"'hello'\": 14358, \"scp\": 14269, \"file\": 14269, \"txt\": 14269, \"cd\": 14075, \"root\": 42231, \"flush\": 14116, \"whoami\": 14292, \"curl\": 14183, \"o\": 14183, \"df\": 14372, \"h\": 14372, \"pwd\": 14409, \"ls\": 28647, \"al\": 14311, \"mkdir\": 14281, \"test\": 14281, \"su\": 14375, \"chmod\": 28878, \"777\": 28878, \"etc\": 71840, \"passwd\": 43157, \"cat\": 28559, \"shadow\": 28683, \"dd\": 14440, \"if\": 14440, \"dev\": 28880, \"zero\": 14440, \"of\": 14440, \"sda\": 14440, \"grep\": 14403, \"'password'\": 14403, \"ifconfig\": 14320, \"ps\": 14173, \"aux\": 14173, \"rm\": 28537, \"rf\": 28537, \"'hacked'\": 14049, \"bashrc\": 14049, \"no\": 14107, \"preserve\": 14107, \"top\": 14130, \"n\": 14130, \"1\": 14130}", "word_docs": "{\"'test'\": 14211, \"find\": 14211, \"name\": 14211, \"uname\": 14364, \"a\": 14364, \"sh\": 42673, \"du\": 14245, \"bin\": 28534, \"tmp\": 42725, \"mv\": 14351, \"bash\": 14351, \"ping\": 14383, \"google\": 14383, \"com\": 57052, \"attacker\": 28432, \"ssh\": 14163, \"8080\": 14163, \"l\": 28412, \"80\": 14163, \"target\": 14163, \"remote\": 28432, \"sudo\": 28624, \"http\": 28506, \"payload\": 14323, \"wget\": 14323, \"malicious\": 28506, \"'malware'\": 14105, \"malware\": 28288, \"echo\": 42512, \"f\": 14464, \"iptables\": 28580, \"tulnp\": 14276, \"netstat\": 14276, \"'hello'\": 14358, \"txt\": 14269, \"file\": 14269, \"scp\": 14269, \"root\": 42231, \"cd\": 14075, \"flush\": 14116, \"whoami\": 14292, \"o\": 14183, \"curl\": 14183, \"df\": 14372, \"h\": 14372, \"pwd\": 14409, \"al\": 14311, \"ls\": 28647, \"test\": 14281, \"mkdir\": 14281, \"su\": 14375, \"777\": 28878, \"passwd\": 43157, \"chmod\": 28878, \"etc\": 71840, \"cat\": 28559, \"shadow\": 28683, \"if\": 14440, \"dev\": 14440, \"of\": 14440, \"zero\": 14440, \"dd\": 14440, \"sda\": 14440, \"'password'\": 14403, \"grep\": 14403, \"ifconfig\": 14320, \"aux\": 14173, \"ps\": 14173, \"rf\": 28537, \"rm\": 28537, \"'hacked'\": 14049, \"bashrc\": 14049, \"preserve\": 14107, \"no\": 14107, \"1\": 14130, \"n\": 14130, \"top\": 14130}", "index_docs": "{\"60\": 14211, \"58\": 14211, \"59\": 14211, \"41\": 14364, \"42\": 14364, \"6\": 42673, \"57\": 14245, \"20\": 28534, \"5\": 42725, \"44\": 14351, \"12\": 14351, \"36\": 14383, \"37\": 14383, \"3\": 57052, \"23\": 28432, \"65\": 14163, \"66\": 14163, \"25\": 28412, \"68\": 14163, \"67\": 14163, \"24\": 28432, \"15\": 28624, \"21\": 28506, \"46\": 14323, \"45\": 14323, \"22\": 28506, \"75\": 14105, \"26\": 28288, \"7\": 42512, \"27\": 14464, \"16\": 28580, \"53\": 14276, \"52\": 14276, \"43\": 14358, \"56\": 14269, \"55\": 14269, \"54\": 14269, \"8\": 42231, \"76\": 14075, \"72\": 14116, \"49\": 14292, \"62\": 14183, \"61\": 14183, \"39\": 14372, \"40\": 14372, \"33\": 14409, \"48\": 14311, \"14\": 28647, \"51\": 14281, \"50\": 14281, \"38\": 14375, \"11\": 28878, \"4\": 43157, \"10\": 28878, \"2\": 71840, \"17\": 28559, \"13\": 28683, \"29\": 14440, \"9\": 14440, \"31\": 14440, \"30\": 14440, \"28\": 14440, \"32\": 14440, \"35\": 14403, \"34\": 14403, \"47\": 14320, \"64\": 14173, \"63\": 14173, \"19\": 28537, \"18\": 28537, \"77\": 14049, \"78\": 14049, \"74\": 14107, \"73\": 14107, \"71\": 14130, \"70\": 14130, \"69\": 14130}", "index_word": "{\"1\": \"<UNK>\", \"2\": \"etc\", \"3\": \"com\", \"4\": \"passwd\", \"5\": \"tmp\", \"6\": \"sh\", \"7\": \"echo\", \"8\": \"root\", \"9\": \"dev\", \"10\": \"chmod\", \"11\": \"777\", \"12\": \"bash\", \"13\": \"shadow\", \"14\": \"ls\", \"15\": \"sudo\", \"16\": \"iptables\", \"17\": \"cat\", \"18\": \"rm\", \"19\": \"rf\", \"20\": \"bin\", \"21\": \"http\", \"22\": \"malicious\", \"23\": \"attacker\", \"24\": \"remote\", \"25\": \"l\", \"26\": \"malware\", \"27\": \"f\", \"28\": \"dd\", \"29\": \"if\", \"30\": \"zero\", \"31\": \"of\", \"32\": \"sda\", \"33\": \"pwd\", \"34\": \"grep\", \"35\": \"'password'\", \"36\": \"ping\", \"37\": \"google\", \"38\": \"su\", \"39\": \"df\", \"40\": \"h\", \"41\": \"uname\", \"42\": \"a\", \"43\": \"'hello'\", \"44\": \"mv\", \"45\": \"wget\", \"46\": \"payload\", \"47\": \"ifconfig\", \"48\": \"al\", \"49\": \"whoami\", \"50\": \"mkdir\", \"51\": \"test\", \"52\": \"netstat\", \"53\": \"tulnp\", \"54\": \"scp\", \"55\": \"file\", \"56\": \"txt\", \"57\": \"du\", \"58\": \"find\", \"59\": \"name\", \"60\": \"'test'\", \"61\": \"curl\", \"62\": \"o\", \"63\": \"ps\", \"64\": \"aux\", \"65\": \"ssh\", \"66\": \"8080\", \"67\": \"target\", \"68\": \"80\", \"69\": \"top\", \"70\": \"n\", \"71\": \"1\", \"72\": \"flush\", \"73\": \"no\", \"74\": \"preserve\", \"75\": \"'malware'\", \"76\": \"cd\", \"77\": \"'hacked'\", \"78\": \"bashrc\"}", "word_index": "{\"<UNK>\": 1, \"etc\": 2, \"com\": 3, \"passwd\": 4, \"tmp\": 5, \"sh\": 6, \"echo\": 7, \"root\": 8, \"dev\": 9, \"chmod\": 10, \"777\": 11, \"bash\": 12, \"shadow\": 13, \"ls\": 14, \"sudo\": 15, \"iptables\": 16, \"cat\": 17, \"rm\": 18, \"rf\": 19, \"bin\": 20, \"http\": 21, \"malicious\": 22, \"attacker\": 23, \"remote\": 24, \"l\": 25, \"malware\": 26, \"f\": 27, \"dd\": 28, \"if\": 29, \"zero\": 30, \"of\": 31, \"sda\": 32, \"pwd\": 33, \"grep\": 34, \"'password'\": 35, \"ping\": 36, \"google\": 37, \"su\": 38, \"df\": 39, \"h\": 40, \"uname\": 41, \"a\": 42, \"'hello'\": 43, \"mv\": 44, \"wget\": 45, \"payload\": 46, \"ifconfig\": 47, \"al\": 48, \"whoami\": 49, \"mkdir\": 50, \"test\": 51, \"netstat\": 52, \"tulnp\": 53, \"scp\": 54, \"file\": 55, \"txt\": 56, \"du\": 57, \"find\": 58, \"name\": 59, \"'test'\": 60, \"curl\": 61, \"o\": 62, \"ps\": 63, \"aux\": 64, \"ssh\": 65, \"8080\": 66, \"target\": 67, \"80\": 68, \"top\": 69, \"n\": 70, \"1\": 71, \"flush\": 72, \"no\": 73, \"preserve\": 74, \"'malware'\": 75, \"cd\": 76, \"'hacked'\": 77, \"bashrc\": 78}"}}